Sudrien/m5tab5_m135_gnss_protomaps_live_area_map/sdkconfig.defaults
CONFIG_TCP_OVERSIZE_MSS=y
CONFIG_UDP_RECVMBOX_SIZE=64
CONFIG_TCPIP_TASK_STACK_SIZE=4096
CONFIG_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_TCPIP_TASK_AFFINITY=0x0
CONFIG_PPP_SUPPORT=y
CONFIG_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_PPP_PAP_SUPPORT=y
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y
CONFIG_NEWLIB_TIME_SYSCALL_USE_RTC_HRT=y
CONFIG_ESP32_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_ESP32_PTHREAD_TASK_STACK_SIZE_DEFAULT=2048
CONFIG_ESP32_PTHREAD_STACK_MIN=768
CONFIG_ESP32_DEFAULT_PTHREAD_CORE_NO_AFFINITY=y
CONFIG_ESP32_PTHREAD_TASK_CORE_DEFAULT=-1
CONFIG_ESP32_PTHREAD_TASK_NAME_DEFAULT="pthread"
CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y
CONFIG_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_SUPPORT_TERMIOS=y
CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
CONFIG_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_SDIO_HOST_INTERFACE=y
CONFIG_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_SDIO_4_BIT_BUS=y
CONFIG_ESP_SDIO_BUS_WIDTH=4
CONFIG_ESP_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_SDIO_PIN_CMD=19
CONFIG_ESP_SDIO_PIN_CLK=18
CONFIG_ESP_SDIO_PIN_D0=14
CONFIG_ESP_SDIO_PIN_D2=16
CONFIG_ESP_SDIO_PIN_D3=17
CONFIG_ESP_SDIO_PIN_D1=15
CONFIG_ESP_SDIO_TX_Q_SIZE=20
CONFIG_ESP_SDIO_RX_Q_SIZE=20
CONFIG_ESP_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_ENABLE_BT_NIMBLE=y
CONFIG_ESP_NIMBLE_HCI_VHCI=y
CONFIG_ESP_RPC_TASK_STACK=4096
CONFIG_ESP_DFLT_TASK_STACK=3072
CONFIG_ESP_USE_MEMPOOL=y
CONFIG_ESP_MAX_SIMULTANEOUS_SYNC_RPC_REQUESTS=5
CONFIG_ESP_MAX_SIMULTANEOUS_ASYNC_RPC_REQUESTS=5
CONFIG_HOST_TO_ESP_WIFI_DATA_THROTTLE=y
CONFIG_PRIV_WIFI_TX_SDIO_HIGH_THRESHOLD=80
CONFIG_TO_WIFI_DATA_THROTTLE_HIGH_THRESHOLD=80
CONFIG_TO_WIFI_DATA_THROTTLE_LOW_THRESHOLD=60
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=32
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_RX_BA_WIN=16
CONFIG_ESP32_WIFI_NVS_ENABLED=y
CONFIG_ESP32_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP32_WIFI_MGMT_SBUF_NUM=32
CONFIG_ESP32_WIFI_IRAM_OPT=y
CONFIG_ESP32_WIFI_RX_IRAM_OPT=y
CONFIG_ESP32_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP32_WIFI_ENABLE_WPA3_OWE_STA=y
CONFIG_WPA_MBEDTLS_CRYPTO=y
CONFIG_WPA_MBEDTLS_TLS_CLIENT=y

# ---------------------------------------------------------------------------
# Project overrides.
# ---------------------------------------------------------------------------

# The target. Filtered out of the import with the other identity symbols;
# without it the build silently defaults to esp32 and configures xtensa.
CONFIG_IDF_TARGET="esp32p4"

# Board variant.
CONFIG_ARDUINO_VARIANT="m5stack_tab5"

# This project's partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- ESP-Hosted SDIO pins (deviation from the reference) -------------------
# The reference carries the generic P4 dev-board pinout. The Tab5 wires the
# C6 to clk 12, cmd 13, d0..d3 11/10/9/8, reset 15 - confirmed against
# M5Stack's own Tab5 firmware, whose sdkconfig carries exactly these values.
#
# These must be the PRIV_..._SLOT_1 symbols, not CONFIG_ESP_HOSTED_SDIO_PIN_*.
# The latter have no prompt:
#     config ESP_HOSTED_SDIO_PIN_CLK
#         int
#         default ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1 if ESP_HOSTED_SDIO_SLOT_1
# so they are derived and setting them here is silently ignored - which is
# exactly what happened: the boot log still read CLK[18] CMD[19] D0[14].
#
# It matters because esp_hosted_host_init() runs from a global constructor,
# so these compile-time values are what the transport actually uses.
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=12
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15

# ---- ESP-Hosted mempool (deviation from the reference) ---------------------
# On this esp_hosted version sdio_mempool_create asserted during global
# constructors with 256 KB of internal RAM free, so it is off here.
#
# Worth revisiting: M5Stack's own Tab5 demo firmware runs with
# CONFIG_ESP_HOSTED_USE_MEMPOOL=y on the same silicon, so the pool is not
# inherently broken. The assert was most likely a side effect of whatever
# else was wrong at the time - the IDF version, or the pins, both since
# fixed. Try turning it back on; if it boots, delete this override.
CONFIG_ESP_HOSTED_USE_MEMPOOL=n

# ---- TEMPORARY: diagnostics ------------------------------------------------
# The reference sets LOG_DEFAULT_LEVEL_ERROR, right for shipping and wrong
# while the board is being brought up: it silences heap_init and esp_psram.
# Not the bootloader's level - raising that overflows its 0x6000 partition.
#
# MAXIMUM at VERBOSE, DEFAULT at INFO. The maximum is compile-time: at INFO
# every ESP_LOGV is discarded by the preprocessor, and M5GFX logs its entire
# I2C probe at that level -
#     ESP_LOGV(LIBRARY_NAME, "[Autodetect] i2c addr:%02x = %s", ...)
# which is exactly what says whether the bus works and what answered. The
# default stays at INFO so nothing else floods; setup() raises M5GFX alone
# with esp_log_level_set("M5GFX", ESP_LOG_VERBOSE).
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
